import streamlit as st
import pandas as pd
import numpy as np
data={
'嗨老友club':[568,868,670,884,144,300,150,280,759,965,658,459],
'巨星livehouse':[577,532,996,926,694,568,868,670,884,144,459,785],
'HEY BABE CLUB':[577,532,996,926,694,577,532,996,926,694,659,876],
'COMMUNE幻师':[120,168,123,568,752,577,532,996,926,694,784,985],
'zeta酒吧':[300,150,280,759,965,577,532,996,926,694,748,459],
}
# 将字典转换为DataFrame数据框
df=pd.DataFrame(data)
# 创建一个Series作为索引，包含1-12月，命名为"月份"
index=pd.Series(['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月','12月'],name='月份')
# 将创建的月份索引设置为DataFrame的行索引
df.index=index
# 在页面上显示交互式数据框
st.dataframe(df)
# 在页面上显示静态表格（不支持交互）
st.table(df)
# 以折线图形式展示数据（x轴为月份，y轴为数值，每条线代表一个场所
st.line_chart(df)
# 以柱状图形式展示数据（x轴为月份，y轴为数值，每组柱子代表一个月份的各场所数据）
st.bar_chart(df)
# 定义一个新字典，存储场所名称及对应的经纬度信息
data = {
    '场所名称': ['嗨老友club', '巨星livehouse', 'HEY BABE CLUB', 'COMMUNE幻师', 'zeta酒吧'],
    'latitude': [22.810370, 22.830402, 22.806038, 22.847441, 22.786225],  # 纬度列（列名符合要求）
    'longitude': [108.399090, 108.390963, 108.375543, 108.320796, 108.305840]  # 经度列（列名符合要求）
}
# 将经纬度数据转换为DataFrame
df = pd.DataFrame(data)
# 在页面上显示地图，根据经纬度标注各个场所的位置
st.map(df)

